Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_SRC.h
#define SRC_SRSR_TEMPSENSE_RST_B_M7_MASK         (0x400U)
#define SRC_SRSR_TEMPSENSE_RST_B_M7_SHIFT        (10U)
/*! TEMPSENSE_RST_B_M7
 *  0b0..Reset is not a result of software reset from Temperature Sensor.
 *  0b1..Reset is a result of software reset from Temperature Sensor.
 */
#define SRC_SRSR_TEMPSENSE_RST_B_M7(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_TEMPSENSE_RST_B_M7_SHIFT)) & SRC_SRSR_TEMPSENSE_RST_B_M7_MASK)

#define SRC_SRSR_OVERVOLT_RST_M7_MASK            (0x2000U)
#define SRC_SRSR_OVERVOLT_RST_M7_SHIFT           (13U)
/*! OVERVOLT_RST_M7
 *  0b0..Reset is not a result of the mentioned case.
 *  0b1..Reset is a result of the mentioned case.
 */
#define SRC_SRSR_OVERVOLT_RST_M7(x)              (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_OVERVOLT_RST_M7_SHIFT)) & SRC_SRSR_OVERVOLT_RST_M7_MASK)

#define SRC_SRSR_CDOG_RST_M7_MASK                (0x4000U)
#define SRC_SRSR_CDOG_RST_M7_SHIFT               (14U)
/*! CDOG_RST_M7
 *  0b0..Reset is not a result of the mentioned case.
 *  0b1..Reset is a result of the mentioned case.
 */
#define SRC_SRSR_CDOG_RST_M7(x)                  (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_CDOG_RST_M7_SHIFT)) & SRC_SRSR_CDOG_RST_M7_MASK)
/*! @} */

/*! @name GPR - SRC General Purpose Register */
/*! @{ */

#define SRC_GPR_GPR_MASK                         (0xFFFFFFFFU)
#define SRC_GPR_GPR_SHIFT                        (0U)
/*! GPR - General Purpose Register. */
#define SRC_GPR_GPR(x)                           (((uint32_t)(((uint32_t)(x)) << SRC_GPR_GPR_SHIFT)) & SRC_GPR_GPR_MASK)
/*! @} */

/*! @name AUTHEN_MEGA - Slice Authentication Register */
/*! @{ */

#define SRC_AUTHEN_MEGA_DOMAIN_MODE_MASK         (0x1U)
#define SRC_AUTHEN_MEGA_DOMAIN_MODE_SHIFT        (0U)
/*! DOMAIN_MODE
 *  0b0..slice hardware reset will NOT be triggered by CPU power mode transition
 *  0b1..slice hardware reset will be triggered by CPU power mode transition. Do not set this bit and SETPOINT_MODE at the same time.
 */
#define SRC_AUTHEN_MEGA_DOMAIN_MODE(x)           (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_DOMAIN_MODE_SHIFT)) & SRC_AUTHEN_MEGA_DOMAIN_MODE_MASK)

#define SRC_AUTHEN_MEGA_SETPOINT_MODE_MASK       (0x2U)
#define SRC_AUTHEN_MEGA_SETPOINT_MODE_SHIFT      (1U)
/*! SETPOINT_MODE
 *  0b0..slice hardware reset will NOT be triggered by Setpoint transition
 *  0b1..slice hardware reset will be triggered by Setpoint transition. Do not set this bit and DOMAIN_MODE at the same time.
 */
#define SRC_AUTHEN_MEGA_SETPOINT_MODE(x)         (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_SETPOINT_MODE_SHIFT)) & SRC_AUTHEN_MEGA_SETPOINT_MODE_MASK)

#define SRC_AUTHEN_MEGA_LOCK_MODE_MASK           (0x80U)
#define SRC_AUTHEN_MEGA_LOCK_MODE_SHIFT          (7U)
/*! LOCK_MODE - Domain/Setpoint mode lock */
#define SRC_AUTHEN_MEGA_LOCK_MODE(x)             (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_LOCK_MODE_SHIFT)) & SRC_AUTHEN_MEGA_LOCK_MODE_MASK)

#define SRC_AUTHEN_MEGA_ASSIGN_LIST_MASK         (0xF00U)
#define SRC_AUTHEN_MEGA_ASSIGN_LIST_SHIFT        (8U)
#define SRC_AUTHEN_MEGA_ASSIGN_LIST(x)           (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_ASSIGN_LIST_SHIFT)) & SRC_AUTHEN_MEGA_ASSIGN_LIST_MASK)

#define SRC_AUTHEN_MEGA_LOCK_ASSIGN_MASK         (0x8000U)
#define SRC_AUTHEN_MEGA_LOCK_ASSIGN_SHIFT        (15U)
/*! LOCK_ASSIGN - Assign list lock */
#define SRC_AUTHEN_MEGA_LOCK_ASSIGN(x)           (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_LOCK_ASSIGN_SHIFT)) & SRC_AUTHEN_MEGA_LOCK_ASSIGN_MASK)

#define SRC_AUTHEN_MEGA_WHITE_LIST_MASK          (0xF0000U)
#define SRC_AUTHEN_MEGA_WHITE_LIST_SHIFT         (16U)
/*! WHITE_LIST - Domain ID white list */
#define SRC_AUTHEN_MEGA_WHITE_LIST(x)            (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_WHITE_LIST_SHIFT)) & SRC_AUTHEN_MEGA_WHITE_LIST_MASK)

#define SRC_AUTHEN_MEGA_LOCK_LIST_MASK           (0x800000U)
#define SRC_AUTHEN_MEGA_LOCK_LIST_SHIFT          (23U)
/*! LOCK_LIST - White list lock */
#define SRC_AUTHEN_MEGA_LOCK_LIST(x)             (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_LOCK_LIST_SHIFT)) & SRC_AUTHEN_MEGA_LOCK_LIST_MASK)

#define SRC_AUTHEN_MEGA_USER_MASK                (0x1000000U)
#define SRC_AUTHEN_MEGA_USER_SHIFT               (24U)
/*! USER - Allow user mode access */
#define SRC_AUTHEN_MEGA_USER(x)                  (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_USER_SHIFT)) & SRC_AUTHEN_MEGA_USER_MASK)

#define SRC_AUTHEN_MEGA_NONSECURE_MASK           (0x2000000U)
#define SRC_AUTHEN_MEGA_NONSECURE_SHIFT          (25U)
/*! NONSECURE - Allow non-secure mode access */
#define SRC_AUTHEN_MEGA_NONSECURE(x)             (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_NONSECURE_SHIFT)) & SRC_AUTHEN_MEGA_NONSECURE_MASK)

#define SRC_AUTHEN_MEGA_LOCK_SETTING_MASK        (0x80000000U)
#define SRC_AUTHEN_MEGA_LOCK_SETTING_SHIFT       (31U)
/*! LOCK_SETTING - Lock NONSECURE and USER */
#define SRC_AUTHEN_MEGA_LOCK_SETTING(x)          (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_LOCK_SETTING_SHIFT)) & SRC_AUTHEN_MEGA_LOCK_SETTING_MASK)
/*! @} */

/*! @name CTRL_MEGA - Slice Control Register */
/*! @{ */

#define SRC_CTRL_MEGA_SW_RESET_MASK              (0x1U)
#define SRC_CTRL_MEGA_SW_RESET_SHIFT             (0U)
/*! SW_RESET
 *  0b0..do not assert slice software reset
 *  0b1..assert slice software reset
 */
#define SRC_CTRL_MEGA_SW_RESET(x)                (((uint32_t)(((uint32_t)(x)) << SRC_CTRL_MEGA_SW_RESET_SHIFT)) & SRC_CTRL_MEGA_SW_RESET_MASK)
/*! @} */

/*! @name SETPOINT_MEGA - Slice Setpoint Config Register */
/*! @{ */

#define SRC_SETPOINT_MEGA_SETPOINT0_MASK         (0x1U)
#define SRC_SETPOINT_MEGA_SETPOINT0_SHIFT        (0U)
/*! SETPOINT0 - SETPOINT0
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT0(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT0_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT0_MASK)

#define SRC_SETPOINT_MEGA_SETPOINT1_MASK         (0x2U)
#define SRC_SETPOINT_MEGA_SETPOINT1_SHIFT        (1U)
/*! SETPOINT1 - SETPOINT1
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT1(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT1_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT1_MASK)

