Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_SRC.h
#define SRC_SETPOINT_M7DEBUG_SETPOINT9_MASK      (0x200U)
#define SRC_SETPOINT_M7DEBUG_SETPOINT9_SHIFT     (9U)
/*! SETPOINT9 - SETPOINT9
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_M7DEBUG_SETPOINT9(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_M7DEBUG_SETPOINT9_SHIFT)) & SRC_SETPOINT_M7DEBUG_SETPOINT9_MASK)

#define SRC_SETPOINT_M7DEBUG_SETPOINT10_MASK     (0x400U)
#define SRC_SETPOINT_M7DEBUG_SETPOINT10_SHIFT    (10U)
/*! SETPOINT10 - SETPOINT10
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_M7DEBUG_SETPOINT10(x)       (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_M7DEBUG_SETPOINT10_SHIFT)) & SRC_SETPOINT_M7DEBUG_SETPOINT10_MASK)

#define SRC_SETPOINT_M7DEBUG_SETPOINT11_MASK     (0x800U)
#define SRC_SETPOINT_M7DEBUG_SETPOINT11_SHIFT    (11U)
/*! SETPOINT11 - SETPOINT11
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_M7DEBUG_SETPOINT11(x)       (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_M7DEBUG_SETPOINT11_SHIFT)) & SRC_SETPOINT_M7DEBUG_SETPOINT11_MASK)

#define SRC_SETPOINT_M7DEBUG_SETPOINT12_MASK     (0x1000U)
#define SRC_SETPOINT_M7DEBUG_SETPOINT12_SHIFT    (12U)
/*! SETPOINT12 - SETPOINT12
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_M7DEBUG_SETPOINT12(x)       (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_M7DEBUG_SETPOINT12_SHIFT)) & SRC_SETPOINT_M7DEBUG_SETPOINT12_MASK)

#define SRC_SETPOINT_M7DEBUG_SETPOINT13_MASK     (0x2000U)
#define SRC_SETPOINT_M7DEBUG_SETPOINT13_SHIFT    (13U)
/*! SETPOINT13 - SETPOINT13
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_M7DEBUG_SETPOINT13(x)       (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_M7DEBUG_SETPOINT13_SHIFT)) & SRC_SETPOINT_M7DEBUG_SETPOINT13_MASK)

#define SRC_SETPOINT_M7DEBUG_SETPOINT14_MASK     (0x4000U)
#define SRC_SETPOINT_M7DEBUG_SETPOINT14_SHIFT    (14U)
/*! SETPOINT14 - SETPOINT14
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_M7DEBUG_SETPOINT14(x)       (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_M7DEBUG_SETPOINT14_SHIFT)) & SRC_SETPOINT_M7DEBUG_SETPOINT14_MASK)

#define SRC_SETPOINT_M7DEBUG_SETPOINT15_MASK     (0x8000U)
#define SRC_SETPOINT_M7DEBUG_SETPOINT15_SHIFT    (15U)
/*! SETPOINT15 - SETPOINT15
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_M7DEBUG_SETPOINT15(x)       (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_M7DEBUG_SETPOINT15_SHIFT)) & SRC_SETPOINT_M7DEBUG_SETPOINT15_MASK)
/*! @} */

/*! @name DOMAIN_M7DEBUG - Slice Domain Config Register */
/*! @{ */

#define SRC_DOMAIN_M7DEBUG_CPU0_RUN_MASK         (0x1U)
#define SRC_DOMAIN_M7DEBUG_CPU0_RUN_SHIFT        (0U)
/*! CPU0_RUN - CPU mode setting for RUN
 *  0b0..Slice reset will be de-asserted when CPU0 in RUN mode
 *  0b1..Slice reset will be asserted when CPU0 in RUN mode
 */
#define SRC_DOMAIN_M7DEBUG_CPU0_RUN(x)           (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7DEBUG_CPU0_RUN_SHIFT)) & SRC_DOMAIN_M7DEBUG_CPU0_RUN_MASK)

#define SRC_DOMAIN_M7DEBUG_CPU0_WAIT_MASK        (0x2U)
#define SRC_DOMAIN_M7DEBUG_CPU0_WAIT_SHIFT       (1U)
/*! CPU0_WAIT - CPU mode setting for WAIT
 *  0b0..Slice reset will be de-asserted when CPU0 in WAIT mode
 *  0b1..Slice reset will be asserted when CPU0 in WAIT mode
 */
#define SRC_DOMAIN_M7DEBUG_CPU0_WAIT(x)          (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7DEBUG_CPU0_WAIT_SHIFT)) & SRC_DOMAIN_M7DEBUG_CPU0_WAIT_MASK)

#define SRC_DOMAIN_M7DEBUG_CPU0_STOP_MASK        (0x4U)
#define SRC_DOMAIN_M7DEBUG_CPU0_STOP_SHIFT       (2U)
/*! CPU0_STOP - CPU mode setting for STOP
 *  0b0..Slice reset will be de-asserted when CPU0 in STOP mode
 *  0b1..Slice reset will be asserted when CPU0 in STOP mode
 */
#define SRC_DOMAIN_M7DEBUG_CPU0_STOP(x)          (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7DEBUG_CPU0_STOP_SHIFT)) & SRC_DOMAIN_M7DEBUG_CPU0_STOP_MASK)

#define SRC_DOMAIN_M7DEBUG_CPU0_SUSP_MASK        (0x8U)
#define SRC_DOMAIN_M7DEBUG_CPU0_SUSP_SHIFT       (3U)
/*! CPU0_SUSP - CPU mode setting for SUSPEND
 *  0b0..Slice reset will be de-asserted when CPU0 in SUSPEND mode
 *  0b1..Slice reset will be asserted when CPU0 in SUSPEND mode
 */
#define SRC_DOMAIN_M7DEBUG_CPU0_SUSP(x)          (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7DEBUG_CPU0_SUSP_SHIFT)) & SRC_DOMAIN_M7DEBUG_CPU0_SUSP_MASK)

#define SRC_DOMAIN_M7DEBUG_CPU1_RUN_MASK         (0x10U)
#define SRC_DOMAIN_M7DEBUG_CPU1_RUN_SHIFT        (4U)
/*! CPU1_RUN - CPU mode setting for RUN
 *  0b0..Slice reset will be de-asserted when CPU1 in RUN mode
 *  0b1..Slice reset will be asserted when CPU1 in RUN mode
 */
#define SRC_DOMAIN_M7DEBUG_CPU1_RUN(x)           (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7DEBUG_CPU1_RUN_SHIFT)) & SRC_DOMAIN_M7DEBUG_CPU1_RUN_MASK)

#define SRC_DOMAIN_M7DEBUG_CPU1_WAIT_MASK        (0x20U)
#define SRC_DOMAIN_M7DEBUG_CPU1_WAIT_SHIFT       (5U)
/*! CPU1_WAIT - CPU mode setting for WAIT
 *  0b0..Slice reset will be de-asserted when CPU1 in WAIT mode
 *  0b1..Slice reset will be asserted when CPU1 in WAIT mode
 */
#define SRC_DOMAIN_M7DEBUG_CPU1_WAIT(x)          (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7DEBUG_CPU1_WAIT_SHIFT)) & SRC_DOMAIN_M7DEBUG_CPU1_WAIT_MASK)

#define SRC_DOMAIN_M7DEBUG_CPU1_STOP_MASK        (0x40U)
#define SRC_DOMAIN_M7DEBUG_CPU1_STOP_SHIFT       (6U)
/*! CPU1_STOP - CPU mode setting for STOP
 *  0b0..Slice reset will be de-asserted when CPU1 in STOP mode
 *  0b1..Slice reset will be asserted when CPU1 in STOP mode
 */
#define SRC_DOMAIN_M7DEBUG_CPU1_STOP(x)          (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7DEBUG_CPU1_STOP_SHIFT)) & SRC_DOMAIN_M7DEBUG_CPU1_STOP_MASK)

